app/controllers/todos_controller.rb

  def index
    @todos = current_user.todos.all
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = $1  [["user_id", 5]]

  def create
    @todo = current_user.todos.new(todo_params)

    if @todo.save
---
INSERT INTO "todos" ("todo", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["todo", "sefsef"], ["created_at", "2017-07-24 09:39:05.908738"], ["updated_at", "2017-07-24 09:39:05.908738"], ["user_id", 4]]